Revit 2026 API

# RevitEventArgs Properties

---

The RevitEventArgs type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Cancel | Indicates whether the event is being cancelled. When the event is cancellable, set the property to True to cancel it. |
|  | Cancellable | Indicates whether an event may be cancelled by an event delegate. |

#### Reference

RevitEventArgs Class

Autodesk.Revit.DB.Events Namespace